Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagC Property
 Gets or sets a value indicating whether the part count is included in the tag C.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IncludePartCountInTagC { get; set; }
Public Property IncludePartCountInTagC As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace